RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW24D5/include/MKW24D5_extension.h
/*
 * Constants & macros for individual RNG_CR bitfields
 */

/*!
 * @name Register RNG_CR, field GO[0] (RW)
 *
 * This bit must be set before the RNGA begins loading data into the RNGA Output
 * Register. This bit is sticky and can only be cleared by a hardware reset .
 * Setting this bit does not bring the RNGA out of Sleep mode. Furthermore, this
 * bit does not need to be reset after exiting Sleep mode.
 *
 * Values:
 * - 0b0 - RNGA Output Register is not loaded with random data.
 * - 0b1 - RNGA Output Register is loaded with random data.
 */
/*@{*/
/*! @brief Read current value of the RNG_CR_GO field. */
#define RNG_RD_CR_GO(base)   ((RNG_CR_REG(base) & RNG_CR_GO_MASK) >> RNG_CR_GO_SHIFT)
#define RNG_BRD_CR_GO(base)  (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_GO_SHIFT))

/*! @brief Set the GO field to a new value. */
#define RNG_WR_CR_GO(base, value) (RNG_RMW_CR(base, RNG_CR_GO_MASK, RNG_CR_GO(value)))
#define RNG_BWR_CR_GO(base, value) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_GO_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RNG_CR, field HA[1] (RW)
 *
 * While this bit is high, a read of the RNGA Output Register while empty causes
 * a security violation. This bit enables security violation bit (SECV) in the
 * RNGA Status Register. This bit is sticky and can only be cleared through a
 * hardware reset.
 *
 * Values:
 * - 0b0 - Notification of security violations is enabled.
 * - 0b1 - Notification of security violations is masked.
 */
/*@{*/
/*! @brief Read current value of the RNG_CR_HA field. */
#define RNG_RD_CR_HA(base)   ((RNG_CR_REG(base) & RNG_CR_HA_MASK) >> RNG_CR_HA_SHIFT)
#define RNG_BRD_CR_HA(base)  (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_HA_SHIFT))

/*! @brief Set the HA field to a new value. */
#define RNG_WR_CR_HA(base, value) (RNG_RMW_CR(base, RNG_CR_HA_MASK, RNG_CR_HA(value)))
#define RNG_BWR_CR_HA(base, value) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_HA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RNG_CR, field INTM[2] (RW)
 *
 * This bit masks the error interrupt.
 *
 * Values:
 * - 0b0 - Interrupt is enabled.
 * - 0b1 - Interrupt is masked.
 */
/*@{*/
/*! @brief Read current value of the RNG_CR_INTM field. */
#define RNG_RD_CR_INTM(base) ((RNG_CR_REG(base) & RNG_CR_INTM_MASK) >> RNG_CR_INTM_SHIFT)
#define RNG_BRD_CR_INTM(base) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_INTM_SHIFT))

/*! @brief Set the INTM field to a new value. */
#define RNG_WR_CR_INTM(base, value) (RNG_RMW_CR(base, RNG_CR_INTM_MASK, RNG_CR_INTM(value)))
#define RNG_BWR_CR_INTM(base, value) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_INTM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RNG_CR, field CLRI[3] (WORZ)
 *
 * Writing a one to this bit clears the error interrupt as well as the error
 * status bit (ERRI) in the RNGA Status Register. The bit is self clearing.
 *
 * Values:
 * - 0b0 - Do not clear the interrupt.
 * - 0b1 - Clear the interrupt.
 */
/*@{*/
/*! @brief Set the CLRI field to a new value. */
#define RNG_WR_CR_CLRI(base, value) (RNG_RMW_CR(base, RNG_CR_CLRI_MASK, RNG_CR_CLRI(value)))
#define RNG_BWR_CR_CLRI(base, value) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_CLRI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RNG_CR, field SLP[4] (RW)
 *
 * The RNGA can be placed in low-power mode by either asserting the module
 * input, or by setting this bit. If either of these conditions are met, the
 * oscillators are disabled. Clearing this bit causes the RNGA to exit Sleep mode. The
 * RNGA Output Register is not pushed while the RNGA is in Sleep mode.
 *
 * Values:
 * - 0b0 - RNGA is not in Sleep mode.
 * - 0b1 - RNGA is in Sleep mode.
 */
/*@{*/
/*! @brief Read current value of the RNG_CR_SLP field. */
#define RNG_RD_CR_SLP(base)  ((RNG_CR_REG(base) & RNG_CR_SLP_MASK) >> RNG_CR_SLP_SHIFT)
#define RNG_BRD_CR_SLP(base) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_SLP_SHIFT))

/*! @brief Set the SLP field to a new value. */
#define RNG_WR_CR_SLP(base, value) (RNG_RMW_CR(base, RNG_CR_SLP_MASK, RNG_CR_SLP(value)))
#define RNG_BWR_CR_SLP(base, value) (BITBAND_ACCESS32(&RNG_CR_REG(base), RNG_CR_SLP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * RNG_SR - RNGA Status Register
 ******************************************************************************/

/*!
 * @brief RNG_SR - RNGA Status Register (RO)
 *
 * Reset value: 0x00010000U
 *
 * The RNGA Status Register is a read only register that reflects the internal
 * status of the RNGA.
 */
/*!
 * @name Constants and macros for entire RNG_SR register
 */
/*@{*/
#define RNG_RD_SR(base)          (RNG_SR_REG(base))
/*@}*/

/*
 * Constants & macros for individual RNG_SR bitfields
 */

/*!
 * @name Register RNG_SR, field SECV[0] (RO)
 *
 * When enabled by the High Assurance bit (HA) in the RNGA Control Register,
 * this bit signals that a security violation has occurred. Currently, RNGA Output
 * Register underflow is the only condition that is considered to be a security
 * violation. The bit is sticky and can be cleared only by a hardware reset.
 *
 * Values:
 * - 0b0 - No security violations have occured or the High Assurance bit (HA) in
 *     the RNGA Control Register is not set.
 * - 0b1 - A security violation has occurred.
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_SECV field. */
#define RNG_RD_SR_SECV(base) ((RNG_SR_REG(base) & RNG_SR_SECV_MASK) >> RNG_SR_SECV_SHIFT)
#define RNG_BRD_SR_SECV(base) (BITBAND_ACCESS32(&RNG_SR_REG(base), RNG_SR_SECV_SHIFT))
/*@}*/

/*!
 * @name Register RNG_SR, field LRS[1] (RO)
 *
 * This bit is always enabled and reflects the status of the most recent read of
 * the RNGA Output Register.
 *
 * Values:
 * - 0b0 - Last read was performed while the RNGA Output Register was not empty.
 * - 0b1 - Last read was performed while the RNGA Output Register was empty
 *     (underflow condition).
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_LRS field. */
#define RNG_RD_SR_LRS(base)  ((RNG_SR_REG(base) & RNG_SR_LRS_MASK) >> RNG_SR_LRS_SHIFT)
#define RNG_BRD_SR_LRS(base) (BITBAND_ACCESS32(&RNG_SR_REG(base), RNG_SR_LRS_SHIFT))
/*@}*/

/*!
 * @name Register RNG_SR, field ORU[2] (RO)
 *
 * This bit is always enabled and signals an RNGA Output Register underflow
 * condition. The bit is reset by reading the RNGA Status Register.
 *
 * Values:
 * - 0b0 - The RNGA Output Register has not been read while empty since last
 *     read of the RNGA Status Register.
 * - 0b1 - The RNGA Output Register has been read while empty since last read of
 *     the RNGA Status Register.
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_ORU field. */
#define RNG_RD_SR_ORU(base)  ((RNG_SR_REG(base) & RNG_SR_ORU_MASK) >> RNG_SR_ORU_SHIFT)
#define RNG_BRD_SR_ORU(base) (BITBAND_ACCESS32(&RNG_SR_REG(base), RNG_SR_ORU_SHIFT))
/*@}*/

/*!
 * @name Register RNG_SR, field ERRI[3] (RO)
 *
 * This bit is always enabled and signals an RNGA Output Register underflow
 * condition. This bit is different from the previous two bits in that it is only
 * reset by a write to the clear interrupt bit (CLRI) in the RNGA Control Register.
 * This bit is not masked by the Interrupt Mask bit of the RNGA Control Register.
 *
 * Values:
 * - 0b0 - The RNGA Output Register has not been read while empty.
 * - 0b1 - The RNGA Output Register has been read while empty.
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_ERRI field. */
#define RNG_RD_SR_ERRI(base) ((RNG_SR_REG(base) & RNG_SR_ERRI_MASK) >> RNG_SR_ERRI_SHIFT)
#define RNG_BRD_SR_ERRI(base) (BITBAND_ACCESS32(&RNG_SR_REG(base), RNG_SR_ERRI_SHIFT))
/*@}*/

/*!
 * @name Register RNG_SR, field SLP[4] (RO)
 *
 * This bit reflects whether the RNGA is in Sleep mode that is, either the Sleep
 * bit (SLP) in the RNGA Control Register is set or the "ipg_doze" input is
 * asserted. When this bit is set, the RNGA is in Sleep mode and the oscillator
 * clocks are inactive. While in this mode, the RNGA Output Register will not be
 * loaded and the RNGA Output Register Level does not increase.
 *
 * Values:
 * - 0b0 - The RNGA is not in Sleep mode.
 * - 0b1 - The RNGA is in Sleep mode.
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_SLP field. */
#define RNG_RD_SR_SLP(base)  ((RNG_SR_REG(base) & RNG_SR_SLP_MASK) >> RNG_SR_SLP_SHIFT)
#define RNG_BRD_SR_SLP(base) (BITBAND_ACCESS32(&RNG_SR_REG(base), RNG_SR_SLP_SHIFT))
/*@}*/

/*!
 * @name Register RNG_SR, field OREG_LVL[15:8] (RO)
 *
 * This bit signals how many random words are currently resident in the RNGA
 * Output Register. Only two values are possible. The bits should be interpreted as
 * an integer (the value 0b00000001 indicates that 0x01 random word is in the
 * RNGA Output Register, while the value 0b00000000 indicates that no random data is
 * in the RNGA Output Register).
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_OREG_LVL field. */
#define RNG_RD_SR_OREG_LVL(base) ((RNG_SR_REG(base) & RNG_SR_OREG_LVL_MASK) >> RNG_SR_OREG_LVL_SHIFT)
#define RNG_BRD_SR_OREG_LVL(base) (RNG_RD_SR_OREG_LVL(base))
/*@}*/

/*!
 * @name Register RNG_SR, field OREG_SIZE[23:16] (RO)
 *
 * This bit signals the actual size of the RNGA Output Register. In other words,
 * this is the maximum possible RNGA Output Register Level. The bits should be
 * interpreted as an integer. This value is set to 0x01.
 */
/*@{*/
/*! @brief Read current value of the RNG_SR_OREG_SIZE field. */
#define RNG_RD_SR_OREG_SIZE(base) ((RNG_SR_REG(base) & RNG_SR_OREG_SIZE_MASK) >> RNG_SR_OREG_SIZE_SHIFT)
#define RNG_BRD_SR_OREG_SIZE(base) (RNG_RD_SR_OREG_SIZE(base))
/*@}*/

